



Internet Engineering Task Force                                  L. Zhou
Internet-Draft                                                     CNNIC
Intended status: Standards Track                                 N. Kong
Expires: February 25, 2019                                    Consultant
                                                                 G. Zhou
                                                                  J. Yao
                                                                   CNNIC
                                                                J. Gould
                                                          Verisign, Inc.
                                                         August 24, 2018


      Extensible Provisioning Protocol (EPP) Organization Mapping
                        draft-ietf-regext-org-10

Abstract

   This document describes an Extensible Provisioning Protocol (EPP)
   mapping for provisioning and management of organization objects
   stored in a shared central repository.  Specified in Extensible
   Markup Language (XML), this extended mapping is applied to provide
   additional features required for the provisioning of organizations.

Status of This Memo

   This Internet-Draft is submitted in full conformance with the
   provisions of BCP 78 and BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF).  Note that other groups may also distribute
   working documents as Internet-Drafts.  The list of current Internet-
   Drafts is at https://datatracker.ietf.org/drafts/current/.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   This Internet-Draft will expire on February 25, 2019.

Copyright Notice

   Copyright (c) 2018 IETF Trust and the persons identified as the
   document authors.  All rights reserved.

   This document is subject to BCP 78 and the IETF Trust's Legal
   Provisions Relating to IETF Documents
   (https://trustee.ietf.org/license-info) in effect on the date of



Zhou, et al.            Expires February 25, 2019               [Page 1]

Internet-Draft          EPP Organization Mapping             August 2018


   publication of this document.  Please review these documents
   carefully, as they describe your rights and restrictions with respect
   to this document.  Code Components extracted from this document must
   include Simplified BSD License text as described in Section 4.e of
   the Trust Legal Provisions and are provided without warranty as
   described in the Simplified BSD License.

Table of Contents

   1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   3
   2.  Conventions Used in This Document . . . . . . . . . . . . . .   3
   3.  Object Attributes . . . . . . . . . . . . . . . . . . . . . .   3
     3.1.  Organization Identifier . . . . . . . . . . . . . . . . .   4
     3.2.  Organization Roles  . . . . . . . . . . . . . . . . . . .   4
       3.2.1.  Role Type . . . . . . . . . . . . . . . . . . . . . .   4
       3.2.2.  Role Status . . . . . . . . . . . . . . . . . . . . .   4
       3.2.3.  Role Identifier . . . . . . . . . . . . . . . . . . .   4
     3.3.  Contact and Client Identifiers  . . . . . . . . . . . . .   5
     3.4.  Organization Status Values  . . . . . . . . . . . . . . .   5
     3.5.  Role Status Values  . . . . . . . . . . . . . . . . . . .   6
     3.6.  Parent Identifier . . . . . . . . . . . . . . . . . . . .   7
     3.7.  URL . . . . . . . . . . . . . . . . . . . . . . . . . . .   7
     3.8.  Dates and Times . . . . . . . . . . . . . . . . . . . . .   7
   4.  EPP Command Mapping . . . . . . . . . . . . . . . . . . . . .   7
     4.1.  EPP Query Commands  . . . . . . . . . . . . . . . . . . .   7
       4.1.1.  EPP <check> Command . . . . . . . . . . . . . . . . .   8
       4.1.2.  EPP <info> Command  . . . . . . . . . . . . . . . . .   9
       4.1.3.  EPP <transfer> Query Command  . . . . . . . . . . . .  15
     4.2.  EPP Transform Commands  . . . . . . . . . . . . . . . . .  15
       4.2.1.  EPP <create> Command  . . . . . . . . . . . . . . . .  15
       4.2.2.  EPP <delete> Command  . . . . . . . . . . . . . . . .  19
       4.2.3.  EPP <renew> Command . . . . . . . . . . . . . . . . .  20
       4.2.4.  EPP <transfer> Command  . . . . . . . . . . . . . . .  20
       4.2.5.  EPP <update> Command  . . . . . . . . . . . . . . . .  21
     4.3.  Offline Review of Requested Actions . . . . . . . . . . .  25
   5.  Formal Syntax . . . . . . . . . . . . . . . . . . . . . . . .  27
   6.  Internationalization Considerations . . . . . . . . . . . . .  36
   7.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .  36
     7.1.  XML Namespace . . . . . . . . . . . . . . . . . . . . . .  36
     7.2.  EPP Extension Registry  . . . . . . . . . . . . . . . . .  37
     7.3.  Role Type Values Registry . . . . . . . . . . . . . . . .  37
       7.3.1.  Registration Template . . . . . . . . . . . . . . . .  37
       7.3.2.  Initial Registry Contents . . . . . . . . . . . . . .  37
   8.  Implementation Status . . . . . . . . . . . . . . . . . . . .  38
     8.1.  Verisign EPP SDK  . . . . . . . . . . . . . . . . . . . .  39
     8.2.  CNNIC Implementation  . . . . . . . . . . . . . . . . . .  39
   9.  Security Considerations . . . . . . . . . . . . . . . . . . .  39
   10. Acknowledgment  . . . . . . . . . . . . . . . . . . . . . . .  40



Zhou, et al.            Expires February 25, 2019               [Page 2]

Internet-Draft          EPP Organization Mapping             August 2018


   11. References  . . . . . . . . . . . . . . . . . . . . . . . . .  40
     11.1.  Normative References . . . . . . . . . . . . . . . . . .  40
     11.2.  Informative References . . . . . . . . . . . . . . . . .  41
   Appendix A.  Change Log . . . . . . . . . . . . . . . . . . . . .  41
   Authors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .  44

1.  Introduction

   There are many entities, such as registrars, resellers, DNS service
   operators, or privacy proxies involved in the domain registration
   business.  These kind of entities have not been formally defined as
   an object in EPP which will be specified as "organization" in this
   document.

   This document describes an organization object mapping for version
   1.0 of the Extensible Provisioning Protocol (EPP) [RFC5730].  This
   mapping is specified using the XML 1.0 as described in
   [W3C.REC-xml-20040204] and XML Schema notation as described in
   [W3C.REC-xmlschema-1-20041028] and [W3C.REC-xmlschema-2-20041028].

2.  Conventions Used in This Document

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in BCP 14
   [RFC2119][RFC8174] when, and only when, they appear in all capitals,
   as shown here.

   In examples, "C:" represents lines sent by a protocol client and "S:"
   represents lines returned by a protocol server.  Indentation and
   white space in examples are provided only to illustrate element
   relationships and are not a required feature of this specification.

   XML is case sensitive.  Unless stated otherwise, XML specifications
   and examples provided in this document MUST be interpreted in the
   character case presented to develop a conforming implementation.

   The XML namespace prefix "org" is used, but implementations MUST NOT
   depend on it and instead employ a proper namespace-aware XML parser
   and serializer to interpret and output the XML documents.

3.  Object Attributes

   An EPP organization object has attributes and associated values that
   can be viewed and modified by the sponsoring client or the server.
   This section describes each attribute type in detail.  The formal
   syntax for the attribute values described here can be found in the




Zhou, et al.            Expires February 25, 2019               [Page 3]

Internet-Draft          EPP Organization Mapping             August 2018


   "Formal Syntax" section of this document and in the appropriate
   normative references.

3.1.  Organization Identifier

   All EPP organizations are identified by a server-unique identifier.
   Organization identifiers are character strings with a specified
   minimum length, a specified maximum length, and a specified format.
   Organization identifiers use the "clIDType" client identifier syntax
   described in [RFC5730].  Its corresponding element is <org:id>.

3.2.  Organization Roles

   The organization roles are used to represent the relationship an
   organization could have.  Its corresponding element is <org:role>.
   An organization object MUST always have at least one associated role.
   Roles can be set only by the client that sponsors an organization
   object.  A client can change the role of an organization object using
   the EPP <update> command.

3.2.1.  Role Type

   An organization role MUST have a type which supports a list of
   values.  An organization could have multiple roles with a different
   role type.  See Section 7.3 for a list of values.  Its corresponding
   element is <org:type>.

3.2.2.  Role Status

   A role of an organization object MAY have its own statuses.  Its
   corresponding element is <org:status>.  The values of the role status
   are defined in Section 3.5.

3.2.3.  Role Identifier

   A role MAY have a third-party-assigned identifier such as the IANA ID
   for registrars.  Its corresponding element is <org:roleID>.

   Example of organization role identifier:


   <org:role>
     <org:type>registrar</org:type>
     <org:status>ok</org:status>
     <org:status>linked</org:status>
     <org:roleID>1362</org:roleID>
   </org:role>




Zhou, et al.            Expires February 25, 2019               [Page 4]

Internet-Draft          EPP Organization Mapping             August 2018


3.3.  Contact and Client Identifiers

   All EPP contacts are identified by a server-unique identifier.
   Contact identifiers are character strings with a specified minimum
   length, a specified maximum length, and a specified format.  Contact
   identifiers use the "clIDType" client identifier syntax described in
   [RFC5730].

3.4.  Organization Status Values

   An organization object MUST always have at least one associated
   status value.

   Status values that can be added or removed by a client are prefixed
   with "client".  Corresponding status values that can be added or
   removed by a server are prefixed with "server".  The "hold" and
   "terminated" status values are server-managed when the organization
   has no parent identifier [Section 3.6] and otherwise MAY be client-
   managed based on server policy.

   Status Value Descriptions:

   o  ok: This is the normal status value for an object that has no
      pending operations or prohibitions.  This value is set and removed
      by the server as other status values are added or removed.

   o  hold: Organization transform commands and new links MUST be
      rejected.

   o  terminated: The organization which has been terminated MUST NOT be
      linked.  Organization transform commands and new links MUST be
      rejected.

   o  linked: The organization object has at least one active
      association with another object.  The "linked" status is not
      explicitly set by the client.  Servers should provide services to
      determine existing object associations.

   o  clientLinkProhibited, serverLinkProhibited: Requests to add new
      links to the organization MUST be rejected.

   o  clientUpdateProhibited, serverUpdateProhibited: Requests to update
      the object (other than to remove this status) MUST be rejected.

   o  clientDeleteProhibited, serverDeleteProhibited: Requests to delete
      the object MUST be rejected.





Zhou, et al.            Expires February 25, 2019               [Page 5]

Internet-Draft          EPP Organization Mapping             August 2018


   o  pendingCreate, pendingUpdate, pendingDelete: A transform command
      has been processed for the object, but the action has not been
      completed by the server.  Server operators can delay action
      completion for a variety of reasons, such as to allow for human
      review or third-party action.  A transform command that is
      processed, but whose requested action is pending, is noted with
      response code 1001.

   "pendingCreate", "ok", "hold", and "terminated" are mutually
   exclusive statuses.  Organization MUST have only one of these
   statuses set.

   "ok" status MAY only be combined with "linked" status.

   A client or server MAY combine "linked" with either
   "clientLinkProhibited" or "serverLinkProhibited" if new links must be
   prohibited.

   "pendingDelete" status MUST NOT be combined with either
   "clientDeleteProhibited" or "serverDeleteProhibited" status.

   The pendingCreate, pendingDelete, and pendingUpdate status values
   MUST NOT be combined with each other.

3.5.  Role Status Values

   A role SHOULD have at least one associated status value.  Valid
   values include "ok", "linked", "clientLinkProhibited", and
   "serverLinkProhibited".

   Status Value Descriptions:

   o  ok: This is the normal status value for an role that has no
      pending operations or prohibitions.  This value is set and removed
      by the server as other status values are added or removed.

   o  linked: The role of an organization object has at least one active
      association with another object.  The "linked" status is not
      explicitly set by the client.  Servers SHOULD provide services to
      determine existing object associations.

   o  clientLinkProhibited, serverLinkProhibited: Requests to add new
      links to the role MUST be rejected.








Zhou, et al.            Expires February 25, 2019               [Page 6]

Internet-Draft          EPP Organization Mapping             August 2018


3.6.  Parent Identifier

   There can be more than one layer of organizations, such as a
   reseller.  The parent identifier, as defined with the <org:parentId>
   element, represents the parent organization identifier in a child
   organization.

   Take a reseller organization, for example, the parent identifier is
   not defined for the top level reseller, namely the registrar of the
   registry.  An N-tier reseller has a parent reseller and at least one
   child reseller.  A reseller customer has a parent reseller and no
   child resellers.

   Loops SHOULD be prohibited.  For example: if organization A has B as
   its parent identifier, organization B should not have organization A
   as its parent identifier.  The same is true for larger loops
   involving three or more organizations.

3.7.  URL

   The URL represents the organization web home page, as defined with
   the <org:url> element.

3.8.  Dates and Times

   Date and time attribute values MUST be represented in Universal
   Coordinated Time (UTC) using the Gregorian calendar.  The extended
   date-time form using upper case "T" and "Z" characters defined in
   [W3C.REC-xmlschema-2-20041028] MUST be used to represent date-time
   values, as XML Schema does not support truncated date-time forms or
   lower case "T" and "Z" characters.

4.  EPP Command Mapping

   A detailed description of the EPP syntax and semantics can be found
   in the EPP core protocol specification [RFC5730].  The command
   mappings described here are specifically for use in provisioning and
   managing organization information via EPP.

4.1.  EPP Query Commands

   EPP provides two commands to retrieve organization information:
   <check> to determine if an organization object can be provisioned
   within a repository, and <info> to retrieve detailed information
   associated with an organization object.  This document does not
   define a mapping for the EPP <transfer> command to retrieve
   organization-object transfer status information.




Zhou, et al.            Expires February 25, 2019               [Page 7]

Internet-Draft          EPP Organization Mapping             August 2018


4.1.1.  EPP <check> Command

   The EPP <check> command is used to determine if an object can be
   provisioned within a repository.  It provides a hint that allows a
   client to anticipate the success or failure of provisioning an object
   using the <create> command, as object-provisioning requirements are
   ultimately a matter of server policy.

   In addition to the standard EPP command elements, the <check> command
   MUST contain an <org:check> element.  This element or its ancestor
   element MUST identify the organization namespace.  The <org:check>
   ement contains the following child elements:

   o  One or more <org:id> elements that contain the server-unique
      identifier of the organization objects to be queried.

   Example <check> command:


   C:<?xml version="1.0" encoding="UTF-8" standalone="no"?>
   C:<epp xmlns="urn:ietf:params:xml:ns:epp-1.0">
   C:  <command>
   C:    <check>
   C:      <org:check
   C:        xmlns:org="urn:ietf:params:xml:ns:epp:org-1.0">
   C:        <org:id>res1523</org:id>
   C:        <org:id>re1523</org:id>
   C:        <org:id>1523res</org:id>
   C:      </org:check>
   C:    </check>
   C:    <clTRID>ABC-12345</clTRID>
   C:  </command>
   C:</epp>

   When a <check> command has been processed successfully, the EPP
   <resData> element MUST contain a child <org:chkData> element.  This
   element or its ancestor element MUST identify the organization
   namespace.  The <org:chkData> element contains one or more <org:cd>
   elements that contain the following child elements:

   o  An <org:id> element that identifies the queried object.  This
      element MUST contain an "avail" attribute whose value indicates
      object availability (can it be provisioned or not) at the moment
      the <check> command was completed.  A value of "1" or "true" means
      that the object can be provisioned.  A value of "0" or "false"
      means that the object cannot be provisioned.





Zhou, et al.            Expires February 25, 2019               [Page 8]

Internet-Draft          EPP Organization Mapping             August 2018


   o  An OPTIONAL <org:reason> element that may be provided when an
      object cannot be provisioned.  If present, this element contains
      server-specific text to help explain why the object cannot be
      provisioned.  This text MUST be represented in the response
      language previously negotiated with the client; an OPTIONAL "lang"
      attribute MAY be present to identify the language if the
      negotiated value is something other than the default value of
      "en"(English).

   Example <check> response:


   S:<?xml version="1.0" encoding="UTF-8" standalone="no"?>
   S:<epp xmlns="urn:ietf:params:xml:ns:epp-1.0">
   S:  <response>
   S:    <result code="1000">
   S:      <msg lang="en">Command completed successfully</msg>
   S:    </result>
   S:    <resData>
   S:      <org:chkData
   S:        xmlns:org="urn:ietf:params:xml:ns:epp:org-1.0">
   S:        <org:cd>
   S:          <org:id avail="1">res1523</org:id>
   S:        </org:cd>
   S:        <org:cd>
   S:          <org:id avail="0">re1523</org:id>
   S:          <org:reason lang="en">In use</org:reason>
   S:        </org:cd>
   S:        <org:cd>
   S:          <org:id avail="1">1523res</org:id>
   S:        </org:cd>
   S:      </org:chkData>
   S:    </resData>
   S:    <trID>
   S:      <clTRID>ABC-12345</clTRID>
   S:      <svTRID>54322-XYZ</svTRID>
   S:    </trID>
   S:  </response>
   S:</epp>

   An EPP error response MUST be returned if a <check> command cannot be
   processed for any reason.

4.1.2.  EPP <info> Command

   The EPP <info> command is used to retrieve information associated
   with an organization object.  It is up to the server policy to decide
   what attributes will be returned of an organization object.  In



Zhou, et al.            Expires February 25, 2019               [Page 9]

Internet-Draft          EPP Organization Mapping             August 2018


   addition to the standard EPP command elements, the <info> command
   MUST contain a <org:info> element.  This element or its ancestor
   element MUST identify the organization namespace.  The <org:info>
   element contains the following child elements:

   o  An <org:id> element that contains the server-unique identifier of
      the organization object to be queried.

   Example <info> command:


   C:<?xml version="1.0" encoding="UTF-8" standalone="no"?>
   C:<epp xmlns="urn:ietf:params:xml:ns:epp-1.0">
   C:  <command>
   C:    <info>
   C:      <org:info
   C:        xmlns:org="urn:ietf:params:xml:ns:epp:org-1.0">
   C:        <org:id>res1523</org:id>
   C:      </org:info>
   C:    </info>
   C:    <clTRID>ABC-12345</clTRID>
   C:  </command>
   C:</epp>

   When an <info> command has been processed successfully, the EPP
   <resData> element MUST contain a child <org:infData> element.  This
   element or its ancestor element MUST identify the organization
   namespace.  The <org:infData> element contains the following child
   elements:

   o  An <org:id> element that contains the server-unique identifier of
      the organization object, as defined in Section 3.1.

   o  An <org:roid> element that contains the Repository Object
      IDentifier assigned to the organization object when the object was
      created.

   o  One or more <org:role> elements that contain the role type, role
      statuses and optional role id of the organization.

      *  An <org:type> element that contains the type of the
         organization, as defined in Section 3.2.

      *  One or more <org:status> elements that contain the role
         statuses.  The values of the role status are defined in
         Section 3.5.





Zhou, et al.            Expires February 25, 2019              [Page 10]

Internet-Draft          EPP Organization Mapping             August 2018


      *  An OPTIONAL <org:roleID> element that contains a third-party-
         assigned identifier, such as IANA ID for registrars, as defined
         in Section 3.2.3.

   o  One or more <org:status> elements that contain the operational
      status of the organization, as defined in Section 3.4.

   o  An OPTIONAL <org:parentId> element that contains the identifier of
      the parent object, as defined in Section 3.6.

   o  Zero to two <org:postalInfo> elements that contain postal-address
      information.  Two elements are provided so that address
      information can be provided in both internationalized and
      localized forms; a "type" attribute is used to identify the two
      forms.  If an internationalized form (type="int") is provided,
      element content MUST be represented in a subset of Unicode in the
      range U+0020 - U+007E.  If a localized form (type="loc") is
      provided, element content MAY be represented in unrestricted UTF-
      8.  The <org:postalInfo> element contains the following child
      elements:

      *  An <org:name> element that contains the name of the
         organization.

      *  An OPTIONAL <org:addr> element that contains address
         information associated with the organization.  A <org:addr>
         element contains the following child elements:

         +  One, two, or three OPTIONAL <org:street> elements that
            contain the organization's street address.

         +  An <org:city> element that contains the organization's city.

         +  An OPTIONAL <org:sp> element that contains the
            organization's state or province.

         +  An OPTIONAL <org:pc> element that contains the
            organization's postal code.

         +  An <org:cc> element that contains the organization's country
            code.

   o  An OPTIONAL <org:voice> element that contains the organization's
      voice telephone number.  The detailed format of this element is
      described in Section 2.5 of [RFC5733].

   o  An OPTIONAL <org:fax> element that contains the organization's
      facsimile telephone number.



Zhou, et al.            Expires February 25, 2019              [Page 11]

Internet-Draft          EPP Organization Mapping             August 2018


   o  An OPTIONAL <org:email> element that contains the organization's
      email address.

   o  An OPTIONAL <org:url> element that contains the URL to the website
      of the organization.

   o  Zero or more OPTIONAL <org:contact> elements that contain
      identifiers for the contact objects to be associated with the
      organization object.  Contact object identifiers MUST be known to
      the server before the contact object can be associated with the
      organization object.  The required "type" is used to represent
      contact types.  The type values include "admin", "tech",
      "billing", "abuse", and "custom".  The OPTIONAL "typeName"
      attribute is used to define the name of a "custom" type.

   o  An OPTIONAL <org:clID> element that contains the organization
      identifier of the sponsoring client.  There is no <org:clID>
      element if the organization is managed by the registry.

   o  An <org:crID> element that contains the identifier of the client
      that created the organization object.

   o  An <org:crDate> element that contains the date and time of
      organization object creation.

   o  An <org:upID> element that contains the identifier of the client
      that last updated the organization object.  This element MUST NOT
      be present if the organization has never been modified.

   o  An <org:upDate> element that contains the date and time of the
      most recent organization object modification.  This element MUST
      NOT be present if the organization object has never been modified.

   Example <info> response for "Example Registrar Inc." organization
   organization object with identifier "registrar1362":


   S:<?xml version="1.0" encoding="UTF-8" standalone="no"?>
   S:<epp xmlns="urn:ietf:params:xml:ns:epp-1.0">
   S:  <response>
   S:    <result code="1000">
   S:      <msg lang="en">Command completed successfully</msg>
   S:    </result>
   S:    <resData>
   S:      <org:infData
   S:        xmlns:org="urn:ietf:params:xml:ns:epp:org-1.0">
   S:        <org:id>registrar1362</org:id>
   S:        <org:roid>registrar1362-REP</org:roid>



Zhou, et al.            Expires February 25, 2019              [Page 12]

Internet-Draft          EPP Organization Mapping             August 2018


   S:        <org:role>
   S:          <org:type>registrar</org:type>
   S:          <org:status>ok</org:status>
   S:          <org:status>linked</org:status>
   S:          <org:roleID>1362</org:roleID>
   S:        </org:role>
   S:        <org:status>ok</org:status>
   S:        <org:postalInfo type="int">
   S:          <org:name>Example Registrar Inc.</org:name>
   S:          <org:addr>
   S:            <org:street>123 Example Dr.</org:street>
   S:            <org:street>Suite 100</org:street>
   S:            <org:city>Dulles</org:city>
   S:            <org:sp>VA</org:sp>
   S:            <org:pc>20166-6503</org:pc>
   S:            <org:cc>US</org:cc>
   S:          </org:addr>
   S:        </org:postalInfo>
   S:        <org:voice x="1234">+1.7035555555</org:voice>
   S:        <org:fax>+1.7035555556</org:fax>
   S:        <org:email>contact@organization.example</org:email>
   S:        <org:url>https://organization.example</org:url>
   S:        <org:contact type="admin">sh8013</org:contact>
   S:        <org:contact type="billing">sh8013</org:contact>
   S:        <org:contact type="custom"
   S:           typeName="legal">sh8013</org:contact>
   S:        <org:crID>ClientX</org:crID>
   S:        <org:crDate>1999-04-03T22:00:00.0Z</org:crDate>
   S:        <org:upID>ClientX</org:upID>
   S:        <org:upDate>1999-12-03T09:00:00.0Z</org:upDate>
   S:      </org:infData>
   S:    </resData>
   S:    <trID>
   S:      <clTRID>ABC-12345</clTRID>
   S:      <svTRID>54322-XYZ</svTRID>
   S:    </trID>
   S:  </response>
   S:</epp>

   Example <info> response for "Example Reseller Inc." organization
   object of reseller type managed by identifier "registrar1362":










Zhou, et al.            Expires February 25, 2019              [Page 13]

Internet-Draft          EPP Organization Mapping             August 2018


   S:<?xml version="1.0" encoding="UTF-8" standalone="no"?>
   S:<epp xmlns="urn:ietf:params:xml:ns:epp-1.0">
   S:  <response>
   S:    <result code="1000">
   S:      <msg lang="en">Command completed successfully</msg>
   S:    </result>
   S:    <resData>
   S:      <org:infData
   S:        xmlns:org="urn:ietf:params:xml:ns:epp:org-1.0">
   S:        <org:id>reseller1523</org:id>
   S:        <org:roid>reseller1523-REP</org:roid>
   S:        <org:role>
   S:          <org:type>reseller</org:type>
   S:          <org:status>ok</org:status>
   S:          <org:status>linked</org:status>
   S:        </org:role>
   S:        <org:status>ok</org:status>
   S:        <org:parentId>registrar1362</org:parentId>
   S:        <org:postalInfo type="int">
   S:          <org:name>Example Reseller Inc.</org:name>
   S:          <org:addr>
   S:            <org:street>123 Example Dr.</org:street>
   S:            <org:street>Suite 100</org:street>
   S:            <org:city>Dulles</org:city>
   S:            <org:sp>VA</org:sp>
   S:            <org:pc>20166-6503</org:pc>
   S:            <org:cc>US</org:cc>
   S:          </org:addr>
   S:        </org:postalInfo>
   S:        <org:fax>+1.7035555556</org:fax>
   S:        <org:url>https://organization.example</org:url>
   S:        <org:contact type="admin">sh8013</org:contact>
   S:        <org:clID>1362</org:clID>
   S:        <org:crID>ClientX</org:crID>
   S:        <org:crDate>1999-04-03T22:00:00.0Z</org:crDate>
   S:        <org:upID>ClientX</org:upID>
   S:        <org:upDate>1999-12-03T09:00:00.0Z</org:upDate>
   S:      </org:infData>
   S:    </resData>
   S:    <trID>
   S:      <clTRID>ABC-12345</clTRID>
   S:      <svTRID>54322-XYZ</svTRID>
   S:    </trID>
   S:  </response>
   S:</epp>

   An EPP error response MUST be returned if an <info> command cannot be
   processed for any reason.



Zhou, et al.            Expires February 25, 2019              [Page 14]

Internet-Draft          EPP Organization Mapping             August 2018


4.1.3.  EPP <transfer> Query Command

   The transfer semantics does not apply to organization object.  No EPP
   <transfer> query command is defined in this document.

4.2.  EPP Transform Commands

   This document provides three commands to transform organization
   object information: <create> to create an instance of an organization
   object, <delete> to delete an instance of an organization object, and
   <update> to change information associated with an organization
   object.  This document does not define a mapping for the EPP
   <transfer> and <renew> command.

   Transform commands are typically processed and completed in real
   time.  Server operators MAY receive and process transform commands
   but defer completing the requested action if human or third-party
   review is required before the requested action can be completed.  In
   such situations, the server MUST return a 1001 response code to the
   client to note that the command has been received and processed but
   that the requested action is pending.  The server MUST also manage
   the status of the object that is the subject of the command to
   reflect the initiation and completion of the requested action.  Once
   the action has been completed, the client MUST be notified using a
   service message that the action has been completed and that the
   status of the object has changed.  Other notification methods MAY be
   used in addition to the required service message.

   Server operators SHOULD confirm that a client is authorized to
   perform a transform command on a given object.  Any attempt to
   transform an object by an unauthorized client MUST be rejected, and
   the server MUST return a 2201 response code to the client to note
   that the client lacks privileges to execute the requested command.

4.2.1.  EPP <create> Command

   The EPP <create> command provides a transform operation that allows a
   client to create an organization object.  In addition to the standard
   EPP command elements, the <create> command MUST contain a
   <org:create> element.  This element or its ancestor element MUST
   identify the organization namespace.  The <org:create> element
   contains the following child elements:

   o  An <org:id> element that contains the desired server-unique
      identifier for the organization to be created, as defined in
      Section 3.1.





Zhou, et al.            Expires February 25, 2019              [Page 15]

Internet-Draft          EPP Organization Mapping             August 2018


   o  One or more <org:role> elements that contain the role type, role
      statuses and optional role id of the organization.

      *  An <org:type> element that contains the type of the
         organization, as defined in Section 3.2.

      *  Zero or more <org:status> elements that contain the role
         statuses.  The values of the role status are defined in
         Section 3.5.

      *  An OPTIONAL <org:roleID> element that contains a third-party-
         assigned identifier, such as IANA ID for registrars, as defined
         in Section 3.2.3.

   o  Zero of more <org:status> element that contain the operational
      status of the organization, as defined in Section 3.4.

   o  An OPTIONAL <org:parentId> element that contains the identifier of
      the parent object, as defined in Section 3.6.

   o  Zero to two <org:postalInfo> elements that contain postal-address
      information.  Two elements are provided so that address
      information can be provided in both internationalized and
      localized forms; a "type" attribute is used to identify the two
      forms.  If an internationalized form (type="int") is provided,
      element content MUST be represented in a subset of Unicode in the
      range U+0020 - U+007E.  If a localized form (type="loc") is
      provided, element content MAY be represented in unrestricted UTF-
      8.  The <org:postalInfo> element contains the following child
      elements:

      *  An <org:name> element that contains the name of the
         organization.

      *  An OPTIONAL <org:addr> element that contains address
         information associated with the organization.  A <org:addr>
         element contains the following child elements:

         +  One, two, or three OPTIONAL <org:street> elements that
            contain the organization's street address.

         +  An <org:city> element that contains the organization's city.

         +  An OPTIONAL <org:sp> element that contains the
            organization's state or province.

         +  An OPTIONAL <org:pc> element that contains the
            organization's postal code.



Zhou, et al.            Expires February 25, 2019              [Page 16]

Internet-Draft          EPP Organization Mapping             August 2018


         +  An <org:cc> element that contains the organization's country
            code.

   o  An OPTIONAL <org:voice> element that contains the organization's
      voice telephone number.

   o  An OPTIONAL <org:fax> element that contains the organization's
      facsimile telephone number.

   o  An OPTIONAL <org:email> element that contains the organization's
      email address.

   o  An OPTIONAL <org:url> element that contains the URL to the website
      of the organization.

   o  Zero or more OPTIONAL <org:contact> elements that contain
      identifiers for the contact objects associated with the
      organization object.

   Example <create> command:































Zhou, et al.            Expires February 25, 2019              [Page 17]

Internet-Draft          EPP Organization Mapping             August 2018


   C:<?xml version="1.0" encoding="UTF-8" standalone="no"?>
   C:<epp xmlns="urn:ietf:params:xml:ns:epp-1.0">
   C:  <command>
   C:    <create>
   C:      <org:create
   C:        xmlns:org="urn:ietf:params:xml:ns:epp:org-1.0">
   C:        <org:id>res1523</org:id>
   C:        <org:role>
   C:          <org:type>reseller</org:type>
   C:        </org:role>
   C:        <org:parentId>1523res</org:parentId>
   C:        <org:postalInfo type="int">
   C:          <org:name>Example Organization Inc.</org:name>
   C:          <org:addr>
   C:            <org:street>123 Example Dr.</org:street>
   C:            <org:street>Suite 100</org:street>
   C:            <org:city>Dulles</org:city>
   C:            <org:sp>VA</org:sp>
   C:            <org:pc>20166-6503</org:pc>
   C:            <org:cc>US</org:cc>
   C:          </org:addr>
   C:        </org:postalInfo>
   C:        <org:voice x="1234">+1.7035555555</org:voice>
   C:        <org:fax>+1.7035555556</org:fax>
   C:        <org:email>contact@organization.example</org:email>
   C:        <org:url>https://organization.example</org:url>
   C:        <org:contact type="admin">sh8013</org:contact>
   C:        <org:contact type="billing">sh8013</org:contact>
   C:      </org:create>
   C:    </create>
   C:    <clTRID>ABC-12345</clTRID>
   C:  </command>
   C:</epp>

   When a <create> command has been processed successfully, the EPP
   <resData> element MUST contain a child <org:creData> element.  This
   element or its ancestor element MUST identify the organization
   namespace.  The <org:creData> element contains the following child
   elements:

   o  An <org:id> element that contains the server-unique identifier for
      the created organization, as defined in Section 3.1.

   o  An <org:crDate> element that contains the date and time of
      organization-object creation.

   Example <create> response:




Zhou, et al.            Expires February 25, 2019              [Page 18]

Internet-Draft          EPP Organization Mapping             August 2018


   S:<?xml version="1.0" encoding="UTF-8" standalone="no"?>
   S:<epp xmlns="urn:ietf:params:xml:ns:epp-1.0">
   S:  <response>
   S:    <result code="1000">
   S:      <msg lang="en">Command completed successfully</msg>
   S:    </result>
   S:    <resData>
   S:      <org:creData
   S:        xmlns:org="urn:ietf:params:xml:ns:epp:org-1.0">
   S:        <org:id>res1523</org:id>
   S:        <org:crDate>1999-04-03T22:00:00.0Z</org:crDate>
   S:      </org:creData>
   S:    </resData>
   S:    <trID>
   S:      <clTRID>ABC-12345</clTRID>
   S:      <svTRID>54321-XYZ</svTRID>
   S:    </trID>
   S:  </response>
   S:</epp>

   An EPP error response MUST be returned if a <create> command cannot
   be processed for any reason.

4.2.2.  EPP <delete> Command

   The EPP <delete> command provides a transform operation that allows a
   client to delete an organization object.  In addition to the standard
   EPP command elements, the <delete> command MUST contain an
   <org:delete> element.  This element or its ancestor element MUST
   identify the organization namespace.  The <org:delete> element MUST
   contain the following child element:

   o  An <org:id> element that contains the server-unique identifier of
      the organization object to be deleted, as defined in Section 3.1.

   An organization object MUST NOT be deleted if it is associated with
   other known objects.  An associated organization MUST NOT be deleted
   until associations with other known objects have been broken.  A
   server MUST notify clients that object relationships exist by sending
   a 2305 error response code when a <delete> command is attempted and
   fails due to existing object relationships.

   Example <delete> command:








Zhou, et al.            Expires February 25, 2019              [Page 19]

Internet-Draft          EPP Organization Mapping             August 2018


   C:<?xml version="1.0" encoding="UTF-8" standalone="no"?>
   C:<epp xmlns="urn:ietf:params:xml:ns:epp-1.0">
   C:  <command>
   C:    <delete>
   C:      <org:delete
   C:       xmlns:org="urn:ietf:params:xml:ns:epp:org-1.0">
   C:        <org:id>res1523</org:id>
   C:      </org:delete>
   C:    </delete>
   C:    <clTRID>ABC-12345</clTRID>
   C:  </command>
   C:</epp>

   When a <delete> command has been processed successfully, a server
   MUST respond with an EPP response with no <resData> element.

   Example <delete> response:


   S:<?xml version="1.0" encoding="UTF-8" standalone="no"?>
   S:<epp xmlns="urn:ietf:params:xml:ns:epp-1.0">
   S:  <response>
   S:    <result code="1000">
   S:      <msg lang="en">Command completed successfully</msg>
   S:    </result>
   S:    <trID>
   S:      <clTRID>ABC-12345</clTRID>
   S:      <svTRID>54321-XYZ</svTRID>
   S:    </trID>
   S:  </response>
   S:</epp>

   An EPP error response MUST be returned if a <delete> command cannot
   be processed for any reason.

4.2.3.  EPP <renew> Command

   Renewal semantics do not apply to organization objects, so there is
   no mapping defined for the EPP <renew> command.

4.2.4.  EPP <transfer> Command

   Transfer semantics do not apply to organization objects, so there is
   no mapping defined for the EPP <transfer> command.







Zhou, et al.            Expires February 25, 2019              [Page 20]

Internet-Draft          EPP Organization Mapping             August 2018


4.2.5.  EPP <update> Command

   The EPP <update> command provides a transform operation that allows a
   client to modify the attributes of an organization object.  In
   addition to the standard EPP command elements, the <update> command
   MUST contain a <org:update> element.  This element or its ancestor
   element MUST identify the organization namespace.  The <org:update>
   element contains the following child elements:

   o  An <org:id> element that contains the server-unique identifier of
      the organization object to be updated, as defined in Section 3.1.

   o  An OPTIONAL <org:add> element that contains attribute values to be
      added to the object.

   o  An OPTIONAL <org:rem> element that contains attribute values to be
      removed from the object.

   o  An OPTIONAL <org:chg> element that contains attribute values to be
      changed.

   At least one <org:add>, <org:rem> or <org:chg> element MUST be
   provided if the command is not being extended.  All of these elements
   MAY be omitted if an <update> extension is present.  The OPTIONAL
   <org:add> and <org:rem> elements contain the following child
   elements:

   o  Zero or more <org:contact> elements that contain the identifiers
      for contact objects to be associated with or removed from the
      organization object.  Contact object identifiers MUST be known to
      the server before the contact object can be associated with the
      organization object.

   o  Zero or more <org:role> elements that contain the role type, role
      statuses and optional role id of the organization.

      *  An <org:type> element that contains the role type of the
         organization, as defined in Section 3.2.  The role type
         uniquely identifies the role to update.

      *  Zero or more <org:status> elements that contain the role
         statuses.  The values of the role status are defined in
         Section 3.5.

      *  An OPTIONAL <org:roleID> element that contains a third-party-
         assigned identifier, such as IANA ID for registrars, as defined
         in Section 3.2.3.




Zhou, et al.            Expires February 25, 2019              [Page 21]

Internet-Draft          EPP Organization Mapping             August 2018


   o  Zero or more <org:status> element that contain the operational
      status of the organization.

   An OPTIONAL <org:chg> element contains the following child elements,
   where at least one child element MUST be present:

   o  An OPTIONAL <org:parentId> element that contains the identifier of
      the parent object.

   o  Zero to two <org:postalInfo> elements that contain postal-address
      information.  Two elements are provided so that address
      information can be provided in both internationalized and
      localized forms; a "type" attribute is used to identify the two
      forms.  If an internationalized form (type="int") is provided,
      element content MUST be represented in a subset of Unicode in the
      range U+0020 - U+007E.  If a localized form (type="loc") is
      provided, element content MAY be represented in unrestricted UTF-
      8.  The change of the postal info is defined as a replacement of
      that postal info element with the contents of the sub-elements
      included in the update command.  An empty <org:postalInfo> element
      is supported to allow a type of postal info to be removed.  The
      <org:postalInfo> element contains the following child elements:

      *  An <org:name> element that contains the name of the
         organization.

      *  An OPTIONAL <org:addr> element that contains address
         information associated with the organization.  A <org:addr>
         element contains the following child elements:

         +  One, two, or three OPTIONAL <org:street> elements that
            contain the organization's street address.

         +  An <org:city> element that contains the organization's city.

         +  An OPTIONAL <org:sp> element that contains the
            organization's state or province.

         +  An OPTIONAL <org:pc> element that contains the
            organization's postal code.

         +  An <org:cc> element that contains the organization's country
            code.

   o  An OPTIONAL <org:voice> element that contains the organization's
      voice telephone number.





Zhou, et al.            Expires February 25, 2019              [Page 22]

Internet-Draft          EPP Organization Mapping             August 2018


   o  An OPTIONAL <org:fax> element that contains the organization's
      facsimile telephone number.

   o  An OPTIONAL <org:email> element that contains the organization's
      email address.

   o  An OPTIONAL <org:url> element that contains the URL to the website
      of the organization.

   Example <update> command:









































Zhou, et al.            Expires February 25, 2019              [Page 23]

Internet-Draft          EPP Organization Mapping             August 2018


   C:<?xml version="1.0" encoding="UTF-8" standalone="no"?>
   C:<epp xmlns="urn:ietf:params:xml:ns:epp-1.0">
   C:  <command>
   C:    <update>
   C:      <org:update
   C:        xmlns:org="urn:ietf:params:xml:ns:epp:org-1.0">
   C:        <org:id>res1523</org:id>
   C:        <org:add>
   C:          <org:contact type="tech">sh8013</org:contact>
   C:          <org:role>
   C:            <org:type>privacyproxy</org:type>
   C:            <org:status>clientLinkProhibited</org:status>
   C:          </org:role>
   C:          <org:status>clientLinkProhibited</org:status>
   C:        </org:add>
   C:        <org:rem>
   C:          <org:contact type="billing">sh8014</org:contact>
   C:          <org:role>
   C:            <org:type>reseller</org:type>
   C:          </org:role>
   C:        </org:rem>
   C:        <org:chg>
   C:          <org:postalInfo type="int">
   C:            <org:addr>
   C:              <org:street>124 Example Dr.</org:street>
   C:              <org:street>Suite 200</org:street>
   C:              <org:city>Dulles</org:city>
   C:              <org:sp>VA</org:sp>
   C:              <org:pc>20166-6503</org:pc>
   C:              <org:cc>US</org:cc>
   C:            </org:addr>
   C:          </org:postalInfo>
   C:          <org:voice>+1.7034444444</org:voice>
   C:          <org:fax/>
   C:        </org:chg>
   C:      </org:update>
   C:    </update>
   C:    <clTRID>ABC-12345</clTRID>
   C:  </command>
   C:</epp>

   When an <update> command has been processed successfully, a server
   MUST respond with an EPP response with no <resData> element.

   Example <update> response:






Zhou, et al.            Expires February 25, 2019              [Page 24]

Internet-Draft          EPP Organization Mapping             August 2018


   S:<?xml version="1.0" encoding="UTF-8" standalone="no"?>
   S:<epp xmlns="urn:ietf:params:xml:ns:epp-1.0">
   S:  <response>
   S:    <result code="1000">
   S:      <msg lang="en">Command completed successfully</msg>
   S:    </result>
   S:    <trID>
   S:      <clTRID>ABC-12345</clTRID>
   S:      <svTRID>54321-XYZ</svTRID>
   S:    </trID>
   S:  </response>
   S:</epp>

   An EPP error response MUST be returned if an <update> command cannot
   be processed for any reason.

4.3.  Offline Review of Requested Actions

   Commands are processed by a server in the order they are received
   from a client.  Though an immediate response confirming receipt and
   processing of the command is produced by the server, a server
   operator MAY perform an offline review of requested transform
   commands before completing the requested action.  In such situations,
   the response from the server MUST clearly note that the transform
   command has been received and processed, but the requested action is
   pending.  The status of the corresponding object MUST clearly reflect
   processing of the pending action.  The server MUST notify the client
   when offline processing of the action has been completed.

   Examples describing a <create> command that requires offline review
   are included here.  Note the result code and message returned in
   response to the <create> command.



















Zhou, et al.            Expires February 25, 2019              [Page 25]

Internet-Draft          EPP Organization Mapping             August 2018


S:<?xml version="1.0" encoding="UTF-8" standalone="no"?>
S:<epp xmlns="urn:ietf:params:xml:ns:epp-1.0">
S:  <response>
S:    <result code="1001">
S:      <msg lang="en">Command completed successfully; action pending</msg>
S:    </result>
S:    <resData>
S:      <org:creData
S:        xmlns:org="urn:ietf:params:xml:ns:epp:org-1.0">
S:        <org:id>res1523</org:id>
S:        <org:crDate>1999-04-03T22:00:00.0Z</org:crDate>
S:      </org:creData>
S:    </resData>
S:    <trID>
S:      <clTRID>ABC-12345</clTRID>
S:      <svTRID>54321-XYZ</svTRID>
S:    </trID>
S:  </response>
S:</epp>


   The status of the organization object after returning this response
   MUST include "pendingCreate".  The server operator reviews the
   request offline, and informs the client of the outcome of the review
   either by queuing a service message for retrieval via the <poll>
   command or by using an out-of-band mechanism to inform the client of
   the request.

   The service message MUST contain text that describes the notification
   in the child <msg> element of the response <msgQ> element.  In
   addition, the EPP <resData> element MUST contain a child
   <org:panData> element.  This element or its ancestor element MUST
   identify the organization namespace.  The <org:panData> element
   contains the following child elements:

   o  An <org:id> element that contains the server-unique identifier of
      the organization object.  The <org:id> element contains a REQUIRED
      "paResult" attribute.  A positive boolean value indicates that the
      request has been approved and completed.  A negative boolean value
      indicates that the request has been denied and the requested
      action has not been taken.

   o  An <org:paTRID> element that contains the client transaction
      identifier and server transaction identifier returned with the
      original response to process the command.  The client transaction
      identifier is OPTIONAL and will only be returned if the client
      provided an identifier with the original <create> command.




Zhou, et al.            Expires February 25, 2019              [Page 26]

Internet-Draft          EPP Organization Mapping             August 2018


   o  An <org:paDate> element that contains the date and time describing
      when review of the requested action was completed.

   Example "review completed" service message:


S:<?xml version="1.0" encoding="UTF-8" standalone="no"?>
S:<epp xmlns="urn:ietf:params:xml:ns:epp-1.0">
S:  <response>
S:    <result code="1301">
S:      <msg lang="en">Command completed successfully; ack to dequeue</msg>
S:    </result>
S:    <msgQ count="5" id="12345">
S:      <qDate>1999-04-04T22:01:00.0Z</qDate>
S:      <msg>Pending action completed successfully.</msg>
S:    </msgQ>
S:    <resData>
S:      <org:panData
S:       xmlns:org="urn:ietf:params:xml:ns:epp:org-1.0">
S:        <org:id paResult="1">res1523</org:id>
S:        <org:paTRID>
S:          <clTRID>ABC-12345</clTRID>
S:          <svTRID>54321-XYZ</svTRID>
S:        </org:paTRID>
S:        <org:paDate>1999-04-04T22:00:00.0Z</org:paDate>
S:      </org:panData>
S:    </resData>
S:    <trID>
S:      <clTRID>BCD-23456</clTRID>
S:      <svTRID>65432-WXY</svTRID>
S:    </trID>
S:  </response>
S:</epp>


5.  Formal Syntax

   An EPP object mapping is specified in XML Schema notation.  The
   formal syntax presented here is a complete schema representation of
   the object mapping suitable for automated validation of EPP XML
   instances.  The BEGIN and END tags are not part of the schema; they
   are used to note the beginning and ending of the schema for URI
   registration purposes.


     BEGIN
     <?xml version="1.0" encoding="UTF-8"?>




Zhou, et al.            Expires February 25, 2019              [Page 27]

Internet-Draft          EPP Organization Mapping             August 2018


     <schema targetNamespace="urn:ietf:params:xml:ns:epp:org-1.0"
            xmlns:org="urn:ietf:params:xml:ns:epp:org-1.0"
            xmlns:epp="urn:ietf:params:xml:ns:epp-1.0"
            xmlns:eppcom="urn:ietf:params:xml:ns:eppcom-1.0"
            xmlns="http://www.w3.org/2001/XMLSchema"
            elementFormDefault="qualified">

     <!--
     Import common element types.
     -->
      <import namespace="urn:ietf:params:xml:ns:eppcom-1.0"/>
      <import namespace="urn:ietf:params:xml:ns:epp-1.0"/>

      <annotation>
        <documentation>
          Extensible Provisioning Protocol v1.0
          organization provisioning schema.
        </documentation>
      </annotation>

     <!--
     Child elements found in EPP commands.
     -->
      <element name="create" type="org:createType"/>
      <element name="delete" type="org:sIDType"/>
      <element name="update" type="org:updateType"/>
      <element name="check" type="org:mIDType"/>
      <element name="info" type="org:infoType"/>
      <element name="panData" type="org:panDataType"/>

     <!--
     Utility types.
     -->
      <simpleType name="statusType">
        <restriction base="token">
          <enumeration value="ok"/>
          <enumeration value="hold"/>
          <enumeration value="terminated"/>
          <enumeration value="clientDeleteProhibited"/>
          <enumeration value="clientUpdateProhibited"/>
          <enumeration value="clientLinkProhibited"/>
          <enumeration value="linked"/>
          <enumeration value="pendingCreate"/>
          <enumeration value="pendingUpdate"/>
          <enumeration value="pendingDelete"/>
          <enumeration value="serverDeleteProhibited"/>
          <enumeration value="serverUpdateProhibited"/>
          <enumeration value="serverLinkProhibited"/>



Zhou, et al.            Expires February 25, 2019              [Page 28]

Internet-Draft          EPP Organization Mapping             August 2018


        </restriction>
      </simpleType>

      <simpleType name="roleStatusType">
        <restriction base="token">
          <enumeration value="ok"/>
          <enumeration value="clientLinkProhibited"/>
          <enumeration value="linked"/>
          <enumeration value="serverLinkProhibited"/>
        </restriction>
      </simpleType>

      <complexType name="roleType">
        <sequence>
          <element name="type" type="token"/>
          <element name="status" type="org:roleStatusType"
            minOccurs="0" maxOccurs="3"/>
          <element name="roleID" type="token" minOccurs="0"/>
        </sequence>
      </complexType>

      <complexType name="postalInfoType">
        <sequence>
          <element name="name"
            type="org:postalLineType"/>
          <element name="addr"
            type="org:addrType" minOccurs="0"/>
        </sequence>
        <attribute name="type"
          type="org:postalInfoEnumType"
          use="required"/>
      </complexType>

      <complexType name="contactType">
        <simpleContent>
          <extension base="eppcom:clIDType">
            <attribute name="type" type="org:contactAttrType"
              use="required"/>
            <attribute name="typeName" type="token"/>
          </extension>
        </simpleContent>
      </complexType>

      <simpleType name="contactAttrType">
        <restriction base="token">
          <enumeration value="admin"/>
          <enumeration value="billing"/>
          <enumeration value="tech"/>



Zhou, et al.            Expires February 25, 2019              [Page 29]

Internet-Draft          EPP Organization Mapping             August 2018


          <enumeration value="abuse"/>
          <enumeration value="custom"/>
        </restriction>
      </simpleType>

      <complexType name="e164Type">
        <simpleContent>
          <extension base="org:e164StringType">
            <attribute name="x" type="token" />
          </extension>
        </simpleContent>
      </complexType>

      <simpleType name="e164StringType">
        <restriction base="token">
          <pattern value="(\+[0-9]{1,3}\.[0-9]{1,14})?" />
          <maxLength value="17" />
        </restriction>
      </simpleType>

      <simpleType name="postalLineType">
        <restriction base="normalizedString">
          <minLength value="1" />
          <maxLength value="255" />
        </restriction>
      </simpleType>

      <simpleType name="optPostalLineType">
        <restriction base="normalizedString">
          <maxLength value="255" />
        </restriction>
      </simpleType>

      <simpleType name="pcType">
        <restriction base="token">
          <maxLength value="16" />
        </restriction>
      </simpleType>

      <simpleType name="ccType">
        <restriction base="token">
          <length value="2" />
        </restriction>
      </simpleType>

      <complexType name="addrType">
        <sequence>
          <element name="street" type="org:optPostalLineType"



Zhou, et al.            Expires February 25, 2019              [Page 30]

Internet-Draft          EPP Organization Mapping             August 2018


            minOccurs="0" maxOccurs="3" />
          <element name="city" type="org:postalLineType" />
          <element name="sp" type="org:optPostalLineType"
            minOccurs="0" />
          <element name="pc" type="org:pcType"
            minOccurs="0" />
          <element name="cc" type="org:ccType" />
        </sequence>
      </complexType>

      <simpleType name="postalInfoEnumType">
        <restriction base="token">
          <enumeration value="loc" />
          <enumeration value="int" />
        </restriction>
      </simpleType>

     <!--
     Child element of commands that require only an identifier.
     -->
      <complexType name="sIDType">
        <sequence>
          <element name="id" type="eppcom:clIDType"/>
        </sequence>
      </complexType>

     <!--
     Child element of commands that accept multiple identifiers.
     -->
      <complexType name="mIDType">
        <sequence>
          <element name="id"
            type="eppcom:clIDType" maxOccurs="unbounded"/>
        </sequence>
      </complexType>

     <!--
     Pending action notification response elements.
     -->
      <complexType name="panDataType">
        <sequence>
          <element name="id" type="org:paCLIDType"/>
          <element name="paTRID" type="epp:trIDType"/>
          <element name="paDate" type="dateTime"/>
        </sequence>
      </complexType>

      <complexType name="paCLIDType">



Zhou, et al.            Expires February 25, 2019              [Page 31]

Internet-Draft          EPP Organization Mapping             August 2018


        <simpleContent>
          <extension base="eppcom:clIDType">
            <attribute name="paResult" type="boolean"
             use="required"/>
          </extension>
        </simpleContent>
      </complexType>

     <!--
     Child elements of the <info> commands.
     -->
      <complexType name="infoType">
        <sequence>
          <element name="id"
            type="eppcom:clIDType"/>
        </sequence>
      </complexType>

     <!--
     Child elements of the <create> command.
     -->
      <complexType name="createType">
        <sequence>
          <element name="id"
            type="eppcom:clIDType"/>
          <element name="role"
            type="org:roleType" maxOccurs="unbounded"/>
          <element name="status"
            type="org:statusType" minOccurs="0" maxOccurs="4"/>
          <element name="parentId"
            type="eppcom:clIDType" minOccurs="0"/>
          <element name="postalInfo"
            type="org:postalInfoType" minOccurs="0" maxOccurs="2"/>
          <element name="voice"
            type="org:e164Type" minOccurs="0"/>
          <element name="fax"
            type="org:e164Type" minOccurs="0"/>
          <element name="email"
            type="eppcom:minTokenType" minOccurs="0"/>
          <element name="url"
            type="anyURI" minOccurs="0"/>
          <element name="contact"
            type="org:contactType"
            minOccurs="0" maxOccurs="unbounded"/>
        </sequence>
      </complexType>

     <!--



Zhou, et al.            Expires February 25, 2019              [Page 32]

Internet-Draft          EPP Organization Mapping             August 2018


     Child elements of the <update> command.
     -->
      <complexType name="updateType">
        <sequence>
          <element name="id"
            type="eppcom:clIDType"/>
          <element name="add"
            type="org:addRemType" minOccurs="0"/>
          <element name="rem"
            type="org:addRemType" minOccurs="0"/>
          <element name="chg"
            type="org:chgType" minOccurs="0"/>
        </sequence>
      </complexType>

     <!--
     Data elements that can be added or removed.
     -->
      <complexType name="addRemType">
        <sequence>
          <element name="contact"
            type="org:contactType" minOccurs="0" maxOccurs="unbounded"/>
          <element name="role" type="org:roleType"
            minOccurs="0" maxOccurs="unbounded"/>
          <element name="status" type="org:statusType"
            minOccurs="0" maxOccurs="9"/>
        </sequence>
      </complexType>

     <!--
     Data elements that can be changed.
     -->
      <complexType name="chgType">
        <sequence>
          <element name="parentId"
            type="eppcom:clIDType" minOccurs="0"/>
          <element name="postalInfo"
            type="org:chgPostalInfoType"
            minOccurs="0" maxOccurs="2"/>
          <element name="voice"
            type="org:e164Type" minOccurs="0"/>
          <element name="fax"
            type="org:e164Type" minOccurs="0"/>
          <element name="email"
            type="eppcom:minTokenType" minOccurs="0"/>
          <element name="url"
            type="anyURI" minOccurs="0"/>
        </sequence>



Zhou, et al.            Expires February 25, 2019              [Page 33]

Internet-Draft          EPP Organization Mapping             August 2018


      </complexType>

      <complexType name="chgPostalInfoType">
        <sequence>
          <element name="name"
            type="org:postalLineType" minOccurs="0"/>
          <element name="addr"
            type="org:addrType" minOccurs="0"/>
        </sequence>
        <attribute name="type"
          type="org:postalInfoEnumType" use="required"/>
      </complexType>

     <!--
     Child response elements.
     -->
      <element name="chkData" type="org:chkDataType"/>
      <element name="creData" type="org:creDataType"/>
      <element name="infData" type="org:infDataType"/>

     <!--
     <check> response elements.
     -->
      <complexType name="chkDataType">
        <sequence>
          <element name="cd" type="org:checkType"
            maxOccurs="unbounded" />
        </sequence>
      </complexType>

      <complexType name="checkType">
        <sequence>
          <element name="id" type="org:checkIDType" />
          <element name="reason" type="eppcom:reasonType"
            minOccurs="0" />
        </sequence>
      </complexType>

      <complexType name="checkIDType">
        <simpleContent>
          <extension base="eppcom:clIDType">
            <attribute name="avail" type="boolean"
              use="required" />
          </extension>
        </simpleContent>
      </complexType>

     <!--



Zhou, et al.            Expires February 25, 2019              [Page 34]

Internet-Draft          EPP Organization Mapping             August 2018


     <info> response elements.
     -->
      <complexType name="infDataType">
        <sequence>
          <element name="id"
            type="eppcom:clIDType"/>
          <element name="roid"
            type="eppcom:roidType"/>
          <element name="role"
            type="org:roleType" maxOccurs="unbounded"/>
          <element name="status"
            type="org:statusType" maxOccurs="9"/>
          <element name="parentId"
            type="eppcom:clIDType" minOccurs="0"/>
          <element name="postalInfo"
            type="org:postalInfoType" minOccurs="0" maxOccurs="2"/>
          <element name="voice"
            type="org:e164Type" minOccurs="0"/>
          <element name="fax"
            type="org:e164Type" minOccurs="0"/>
          <element name="email"
            type="eppcom:minTokenType" minOccurs="0"/>
          <element name="url"
            type="anyURI" minOccurs="0"/>
          <element name="contact"
            type="org:contactType" minOccurs="0" maxOccurs="unbounded"/>
          <element name="clID"
            type="eppcom:clIDType" minOccurs="0"/>
          <element name="crID"
            type="eppcom:clIDType"/>
          <element name="crDate"
            type="dateTime"/>
          <element name="upID"
            type="eppcom:clIDType" minOccurs="0"/>
          <element name="upDate"
            type="dateTime" minOccurs="0"/>
        </sequence>
      </complexType>
     <!--
     <create> response elements.
     -->
      <complexType name="creDataType">
        <sequence>
          <element name="id" type="eppcom:clIDType" />
          <element name="crDate" type="dateTime" />
        </sequence>
      </complexType>




Zhou, et al.            Expires February 25, 2019              [Page 35]

Internet-Draft          EPP Organization Mapping             August 2018


     <!--
     End of schema.
     -->
     </schema>
     END

6.  Internationalization Considerations

   EPP is represented in XML, which provides native support for encoding
   information using the Unicode character set and its more compact
   representations including UTF-8.  Conformant XML processors recognize
   both UTF-8 [RFC3629] and UTF-16 [RFC2718].  Though XML includes
   provisions to identify and use other character encodings through use
   of an "encoding" attribute in an <?xml?> declaration, use of UTF-8 is
   RECOMMENDED.

   As an extension of the EPP organization object mapping, the elements
   and element content described in this document MUST inherit the
   internationalization conventions used to represent higher-layer
   domain and core protocol structures present in an XML instance that
   includes this extension.

7.  IANA Considerations

7.1.  XML Namespace

   This document uses URNs to describe XML namespaces and XML schemas
   conforming to a registry mechanism described in [RFC3688].  IANA is
   requested to assignment the following URI.

   Registration request for the organization namespace:

      URI: urn:ietf:params:xml:ns:epp:org-1.0

      Registrant Contact: IESG

      XML: None.  Namespace URIs do not represent an XML specification.

   Registration request for the organization XML schema:

      URI: urn:ietf:params:xml:schema:epp:org-1.0

      Registrant Contact: IESG

      XML: See the "Formal Syntax" section of this document.






Zhou, et al.            Expires February 25, 2019              [Page 36]

Internet-Draft          EPP Organization Mapping             August 2018


7.2.  EPP Extension Registry

   The EPP extension described in this document should be registered by
   the IANA in the EPP Extension Registry described in [RFC7451].  The
   details of the registration are as follows:

      Name of Extension: Extensible Provisioning Protocol (EPP)
      Organization Mapping

      Registrant Name and Email Address: IESG, iesg@ietf.org

      TLDs: Any

      IPR Disclosure: None

      Status: Active

      Notes: None

7.3.  Role Type Values Registry

   IANA has created a new category of protocol registry for values of
   the organization roles.  The name of this registry is "EPP
   Organization Role Values".  The registration policy for this registry
   is "Expert Review" [RFC8126].

7.3.1.  Registration Template

   Value: the string value being registered.

   Description: Brief description of the organization role values.

   Registrant Name: For Standards Track RFCs, state "IESG".  For others,
   give the name of the responsible party.

   Registrant Contact Information: an email address, postal address, or
   some other information to be used to contact the registrant.

7.3.2.  Initial Registry Contents

   Followings are the initial registry contents:

      Value: registrar

      Description: The entity object instance represents the authority
      responsible for the registration in the registry.

      Registrant Name: IESG



Zhou, et al.            Expires February 25, 2019              [Page 37]

Internet-Draft          EPP Organization Mapping             August 2018


      Registrant Contact Information: iesg@ietf.org

      Value: reseller

      Description: The entity object instance represents a third party
      through which the registration was conducted (i.e., not the
      registry or registrar).

      Registrant Name: IESG

      Registrant Contact Information: iesg@ietf.org

      Value: privacyproxy

      Description: The entity object instance represents a third-party
      who could help to register a domain without exposing the
      registrants' private information.

      Registrant Name: IESG

      Registrant Contact Information: iesg@ietf.org

      Value: dns-operator

      Description: The entity object instance represents a third-party
      DNS operator that maintains the name servers and zone data on
      behalf of a registrant.

      Registrant Name: IESG

      Registrant Contact Information: iesg@ietf.org

8.  Implementation Status

   Note to RFC Editor: Please remove this section and the reference to
   [RFC7942] before publication.  This section records the status of
   known implementations of the protocol defined by this specification
   at the time of posting of this Internet-Draft, and is based on a
   proposal described in [RFC7942].  The description of implementations
   in this section is intended to assist the IETF in its decision
   processes in progressing drafts to RFCs.  Please note that the
   listing of any individual implementation here does not imply
   endorsement by the IETF.  Furthermore, no effort has been spent to
   verify the information presented here that was supplied by IETF
   contributors.  This is not intended as, and must not be construed to
   be, a catalog of available implementations or their features.
   Readers are advised to note that other implementations may exist.




Zhou, et al.            Expires February 25, 2019              [Page 38]

Internet-Draft          EPP Organization Mapping             August 2018


   According to [RFC7942], "this will allow reviewers and working groups
   to assign due consideration to documents that have the benefit of
   running code, which may serve as evidence of valuable experimentation
   and feedback that have made the implemented protocols more mature.
   It is up to the individual working groups to use this information as
   they see fit".

8.1.  Verisign EPP SDK

   Organization: Verisign Inc.

   Name: Verisign EPP SDK

   Description: The Verisign EPP SDK includes both a full client
   implementation and a full server stub implementation of draft-ietf-
   regext-org.

   Level of maturity: Development

   Coverage: All aspects of the protocol are implemented.

   Licensing: GNU Lesser General Public License

   Contact: jgould@verisign.com

   URL: https://www.verisign.com/en_US/channel-resources/domain-
   registry-products/epp-sdks

8.2.  CNNIC Implementation

   Organization: CNNIC

   Name: EPP Organization Mapping

   Description: CNNIC is trying to update EPP organization mapping from
   previous reseller mapping according to this document.

   Level of maturity: Development

   Coverage: EPP organization mapping

   Contact: zhouguiqing@cnnic.cn

9.  Security Considerations

   The object mapping extension described in this document does not
   provide any other security services or introduce any additional
   considerations beyond those described by [RFC5730] or those caused by



Zhou, et al.            Expires February 25, 2019              [Page 39]

Internet-Draft          EPP Organization Mapping             August 2018


   the protocol layers used by EPP.  The security considerations
   described in these other specifications apply to this specification
   as well.

10.  Acknowledgment

   The authors would like to thank Rik Ribbers, Marc Groeneweg, Patrick
   Mevzek, Antoin Verschuren and Scott Hollenbeck for their careful
   review and valuable comments.

11.  References

11.1.  Normative References

   [RFC2119]  Bradner, S., "Key words for use in RFCs to Indicate
              Requirement Levels", BCP 14, RFC 2119,
              DOI 10.17487/RFC2119, March 1997,
              <https://www.rfc-editor.org/info/rfc2119>.

   [RFC2718]  Masinter, L., Alvestrand, H., Zigmond, D., and R. Petke,
              "Guidelines for new URL Schemes", RFC 2718,
              DOI 10.17487/RFC2718, November 1999,
              <https://www.rfc-editor.org/info/rfc2718>.

   [RFC3629]  Yergeau, F., "UTF-8, a transformation format of ISO
              10646", STD 63, RFC 3629, DOI 10.17487/RFC3629, November
              2003, <https://www.rfc-editor.org/info/rfc3629>.

   [RFC3688]  Mealling, M., "The IETF XML Registry", BCP 81, RFC 3688,
              DOI 10.17487/RFC3688, January 2004,
              <https://www.rfc-editor.org/info/rfc3688>.

   [RFC5730]  Hollenbeck, S., "Extensible Provisioning Protocol (EPP)",
              STD 69, RFC 5730, DOI 10.17487/RFC5730, August 2009,
              <https://www.rfc-editor.org/info/rfc5730>.

   [RFC5733]  Hollenbeck, S., "Extensible Provisioning Protocol (EPP)
              Contact Mapping", STD 69, RFC 5733, DOI 10.17487/RFC5733,
              August 2009, <https://www.rfc-editor.org/info/rfc5733>.

   [RFC7942]  Sheffer, Y. and A. Farrel, "Improving Awareness of Running
              Code: The Implementation Status Section", BCP 205,
              RFC 7942, DOI 10.17487/RFC7942, July 2016,
              <https://www.rfc-editor.org/info/rfc7942>.







Zhou, et al.            Expires February 25, 2019              [Page 40]

Internet-Draft          EPP Organization Mapping             August 2018


   [RFC8126]  Cotton, M., Leiba, B., and T. Narten, "Guidelines for
              Writing an IANA Considerations Section in RFCs", BCP 26,
              RFC 8126, DOI 10.17487/RFC8126, June 2017,
              <https://www.rfc-editor.org/info/rfc8126>.

   [RFC8174]  Leiba, B., "Ambiguity of Uppercase vs Lowercase in RFC
              2119 Key Words", BCP 14, RFC 8174, DOI 10.17487/RFC8174,
              May 2017, <https://www.rfc-editor.org/info/rfc8174>.

   [W3C.REC-xml-20040204]
              Bray, T., Paoli, J., Sperberg-McQueen, C., Maler, E., and
              F. Yergeau, ""Extensible Markup Language (XML) 1.0 (Third
              Edition)", World Wide Web Consortium FirstEdition REC-xml-
              20040204", February 2004,
              <http://www.w3.org/TR/2004/REC-xml-20040204>.

   [W3C.REC-xmlschema-1-20041028]
              Thompson, H., Beech, D., Maloney, M., and N. Mendelsohn,
              ""XML Schema Part 1: Structures Second Edition", World
              Wide Web Consortium Recommendation REC-xmlschema-
              1-20041028", October 2004,
              <http://www.w3.org/TR/2004/REC-xmlschema-1-20041028>.

   [W3C.REC-xmlschema-2-20041028]
              Biron, P. and A. Malhotra, ""XML Schema Part 2: Datatypes
              Second Edition", World Wide Web Consortium Recommendation
              REC-xmlschema-2-20041028", October 2004,
              <http://www.w3.org/TR/2004/REC-xmlschema-2-20041028>.

11.2.  Informative References

   [RFC7451]  Hollenbeck, S., "Extension Registry for the Extensible
              Provisioning Protocol", RFC 7451, DOI 10.17487/RFC7451,
              February 2015, <https://www.rfc-editor.org/info/rfc7451>.

Appendix A.  Change Log

   Initial -00:  Individual document submitted.

   -01:

      *  Updated abstract text.

      *  Added sentences to avoid loop of parent identifiers in section
         3.4.

      *  Revised typos in section 3.6.




Zhou, et al.            Expires February 25, 2019              [Page 41]

Internet-Draft          EPP Organization Mapping             August 2018


      *  Added explanation of contact type attribute in section 4.1.2.

      *  Updated <info> responses.

      *  Deleted description of <transfer> command in section 4.1 and
         4.2.

      *  Deleted whoisInfo disclose type in XML schema.

      *  Deleted maxOccurs of addRemType.

      *  Deleted extra "OPTIONAL" in section 4.2.5.

      *  Updated typos in <update> response.

   -02:

      *  Changed author information.

      *  Updated url definition.

      *  Updated XML schema.

   -03:

      *  Changed author information.

      *  Updated section 3.1.

      *  Refactoried the XSD file.  Added <chgPostalInfoType> element.

      *  Added acknowledgment.

   WG document-00:  WG document submitted

   WG document-01:  Keep document alive for further discussion.
      Reseller object or entity object with multiple roles?

   Organization WG document-00:  Change to a generic organization object
      mapping.

   Organization WG document-01:  Added "Implementation Status" section.

   Organization WG document-02:  Accepted some of the feedbacks on the
      mailing list.

   Organization WG document-03:




Zhou, et al.            Expires February 25, 2019              [Page 42]

Internet-Draft          EPP Organization Mapping             August 2018


      *  Updated section 3.2, changed the structure of organization
         role.

      *  Updated section 4.2.5 for the "add", "rem" and "chg" example.

      *  Updated section 5 of formal syntax.

      *  Updated section 7.2 for the registration template and initial
         values.

      *  Updated section 8 of implementation status.

   Organization WG document-04:

      *  Updated section 3.2, changed the structure of organization
         role.

      *  Updated references.

      *  Updated section 8 of implementation status.

   Organization WG document-05:

      *  Updated the description of <org:status> of a role.

      *  Removed the third paragraph of "Implementation Status".

      *  Remove the Informative Reference to draft-ietf-regext-reseller
         from the draft.

   Organization WG document-06:

      *  Updated typos.

      *  Added "Query" for "<Transfer> Query Command".

      *  Change "Registrant Contact" to IESG in section 7.1.

      *  Modified section 7.2.

   Organization WG document-07:

      *  Updated typos.

      *  Added dns-operator in section 7.1.

      *  Added "OPTIONAL" for <org:addr>




Zhou, et al.            Expires February 25, 2019              [Page 43]

Internet-Draft          EPP Organization Mapping             August 2018


   Organization WG document-08:

      *  Updated "Offline Review of Requested Actions".

   Organization WG document-09:

      *  Updated "This element or its ancestor element MUST identify the
         organization namespace." in section 4.1.1 and other parts of
         this document.

      *  Updated text in section 2 match RFC 8174.

      *  Modified "roleid" to "roleID".

      *  Updated text about loops in section 3.6.

      *  Referred section 2.5 of RFC5733 for voice format.

      *  Updated XML schema for the maxOccurs value of "reason" element.

      *  Updated section 7.3.

      *  Replaced "http" with "https" in the examples.

      *  Updated writing typos.

      *  Modified XML namespace and schema.

   Organization WG document-10:

      *  Modified XML namespace and schema.

      *  Removed the maxOccurs value of "reason" element.

Authors' Addresses

   Linlin Zhou
   CNNIC
   4 South 4th Street, Zhongguancun, Haidian District
   Beijing, Beijing  100190
   China

   Email: zhoulinlin@cnnic.cn








Zhou, et al.            Expires February 25, 2019              [Page 44]

Internet-Draft          EPP Organization Mapping             August 2018


   Ning Kong
   Consultant

   Email: ietfing@gmail.com


   Guiqing Zhou
   CNNIC
   4 South 4th Street, Zhongguancun, Haidian District
   Beijing, Beijing  100190
   China

   Email: zhouguiqing@cnnic.cn


   Jiankang Yao
   CNNIC
   4 South 4th Street, Zhongguancun, Haidian District
   Beijing, Beijing  100190
   China

   Email: yaojk@cnnic.cn


   James Gould
   Verisign, Inc.
   12061 Bluemont Way
   Reston, VA  20190
   US

   Email: jgould@verisign.com




















Zhou, et al.            Expires February 25, 2019              [Page 45]
